Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/civil_law/index.html.txt.tmx
Source language: en
Languages: ga

source: Ireland's InjuriesBoard.ie decides on personal injury claims where the person responsible for the injury is not disputing liability and consents to the Board assessing the claim for compensation
ga: Déanann InjuriesBoard.ie na hÉireann cinneadh maidir le héilimh ar dhíobháil phearsanta sa chás nach bhfuil an duine a bhí freagrach as an ngortú ag cur i gcoinne dliteanais agus go dtoilíonn sé/sí don Bhord measúnú a dhéanamh ar an éileamh ar chúiteamh

source: Small claims and a court hearing
ga: Éilimh bheaga agus éisteacht chúirte

source: If your small claims procedure case cannot be resolved it may be referred for a hearing in the District Court
ga: Mura féidir do nós imeachta um éilimh bheaga a fhuascailt, d’fhéadfaí é a atreorú dá éisteacht sa Chúirt Dúiche

source: Taking a civil case
ga: Cás Sibhialta a thógáil

source: An introduction to the issues and procedures involved in a civil case?
ga: Tá cur síos anseo ar na bunchéimeanna a bhaineann le cás sibhialta

source: An outline of the concepts of negligence and compensation in civil cases is presented
ga: Tá cur síos sa cháipéis seo ar fhaillí agus ar chúiteamh

source: When do you require legal representation and who represents you in court?
ga: Tá cur síos anseo ar ghairm an dlí

source: Legal fees and costs for civil cases
ga: Táillí dlí agus costais ar chásanna sibhialta

source: Explains what fees and costs means in a civil case
ga: Tá cur síos sa cháipéis seo ar na costais a bhaineann le Cás Sibhialta

source: This document provides a general overview of writs and pleadings in civil cases
ga: Tugann an doiciméad seo forbhreathnú ginearálta ar eascairí agus pleadálacha i gcásanna sibhialta

source: A claim notice is used to commence proceedings in the District Court
ga: Úsáidtear fógra éilimh chun tús a chur le himeachtaí sa Chúirt Dúiche

source: Find out more about the forms that are used and the procedures that are followed
ga: Aimsigh breis faisnéise faoi na foirmeacha a úsáidtear agus na nósanna imeachta a leantar

source: A Civil Bill is a document that you must serve on the defendant in order to commence proceedings in the Circuit Court
ga: Cuireann an doiciméad seo síos ar an 'mBille Sibhialta', dociméad nár mhór duit a sheirbheáil ar an gCosantóir chun imeachtaí a thosú sa Chúirt Chuarda

source: An originating summons is a summons that usually commences civil proceedings in the High Courti
ga: Toghairm a chuireann tús le himeachtaí sibhialta san Ard Chúirt is ea an toghairm thionscnaimh

source: This document describes how claims are settled in civil cases
ga: Tá cur síos sa cháipéis seo ar chás a réiteach

source: Civil court cases follow a standard format
ga: Imeachtaí i gcásanna cúirte sibhialta

source: Information on proceedings, how witnesses are called and liability
ga: Tá cur síos sa cháipéis seo ar éisteacht cúirte i gcás sibhialta

source: Appealing the Decision in a Civil Case
ga: Achomharc ar an gCinneadh

source: Find out how to appeal a decision in a civil court case in Ireland
ga: Tá cur síos sa cháipéis seo ar cén chaoi achomharc a dhéanamh i gcás sibhialta

source: Functions, responsibilities and duties of Commissioners for Oaths are described and an explanation of the services they provide in Ireland is provided
ga: Cur síos ar na feidhmheanna agus dualgais atá ar Choimisinéirí Mionn

source: Peace Commissioners in Ireland have legal functions and are honorary appointments
ga: Pléann an cháipéis seo na dualgais atá ar Choimisinéirí Síochána

source: A notary public serves the public in non-contentious matters usually concerned with foreign or international business
ga: Déanann nótaire poiblí freastal ar an bpobal in ábhair neamhchonspóideacha a bhaineann de ghnáth le gnó iasachta nó idirnáisiúnta

source: Most Read in "Justice"
ga: Ábhar is mó éilimh i "Dlí"

source: Alcohol and the law
ga: Alcól agus an dlí
